In [8]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando","brazil"],
    "temperature": [21,14,35,34],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35
3    brazil           34

In [10]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando","Russia","Africa"],
    "humidity": [65,68,75,5,1],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75
3    Russia         5
4    Africa         1

In [16]:
# Merge df1 and df2 dataframes on the "city" column
# This creates a new dataframe (df3) containing all columns from both dataframes
# where the city values match
df3 = pd.merge(df1, df2, on="city")
df3  # Display the merged dataframe

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [17]:
# Merge df1 and df2 dataframes on the "city" column using an outer join
# An outer join keeps all rows from both dataframes, filling with NaN where there's no match
df3 = pd.merge(df1,df2,on = "city",how = "outer")
df3  # Display the resulting merged dataframe

       city  temperature  humidity
0    Africa          NaN       1.0
1    Russia          NaN       5.0
2    brazil         34.0       NaN
3   chicago         14.0      65.0
4  new york         21.0      68.0
5   orlando         35.0      75.0

In [18]:
# Merge df1 and df2 dataframes on the "city" column using inner join
# Inner join keeps only the rows where the "city" values match in both dataframes
df3 = pd.merge(df1,df2,on = "city",how = "inner")
df3  # Display the resulting merged dataframe

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [19]:
# Merge df1 and df2 dataframes on the "city" column using an outer join
# The "outer" join keeps all rows from both dataframes
# The "indicator=True" parameter adds a column "_merge" showing the source of each row
df3 = pd.merge(df1,df2,on = "city",how = "outer",indicator = True)
df3

       city  temperature  humidity      _merge
0    Africa          NaN       1.0  right_only
1    Russia          NaN       5.0  right_only
2    brazil         34.0       NaN   left_only
3   chicago         14.0      65.0        both
4  new york         21.0      68.0        both
5   orlando         35.0      75.0        both

In [20]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [21]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [26]:
# Merge df1 and df2 dataframes on the "city" column using an outer join
# This keeps all rows from both dataframes, adding NaN values where data is missing
# The suffixes '_first' and '_second' are added to column names that exist in both dataframes
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3  # Display the merged dataframe

          temperature  humidity
city
chicago            14        65
new york           21        68
orlando            35        75

In [23]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [24]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [27]:
# Join df1 with df2 dataframes, adding suffixes '_l' and '_r' to overlapping column names
# to distinguish between columns from the left (df1) and right (df2) dataframes
df1.join(df2,lsuffix='_l', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75